# **Structured Query Language**
- is a `programming language` used for **managing** and **manipulating data** held in a relational database management system (RDBMS).
- specifically designed for interacting with databases. It allows you to perform various operations like **querying** data, **inserting** new records, **updating** existing records, and **deleting** records.

### Database Structure
- In SQL, the data is stored in tables, which are organized into databases.
- Each table consists of **rows** and **columns**.
- `Rows` represent individual record, `Columns` represent attributes or fields of those records

### CRUD Operations
CRUD stands for Create, Read, Update, and Delete. 
1. **Create**: Add new records to a table.
2. **Read**: Retrieve data from a table.
3. **Update**: Modify existing records in a table.
4. **Delete**: Remove records from a table.

### Setting Up Environment

In [1]:
%pip install ipython-sql

Collecting ipython-sql
  Downloading ipython_sql-0.5.0-py3-none-any.whl (20 kB)
Collecting sqlparse
  Downloading sqlparse-0.5.0-py3-none-any.whl (43 kB)
     -------------------------------------- 44.0/44.0 kB 717.7 kB/s eta 0:00:00
Collecting sqlalchemy>=2.0
  Downloading SQLAlchemy-2.0.30-cp310-cp310-win_amd64.whl (2.1 MB)
     ---------------------------------------- 2.1/2.1 MB 7.8 MB/s eta 0:00:00
Collecting ipython-genutils
  Downloading ipython_genutils-0.2.0-py2.py3-none-any.whl (26 kB)
Requirement already satisfied: six in c:\users\rein\onedrive\desktop\dph02\venv\lib\site-packages (from ipython-sql) (1.16.0)
Collecting prettytable
  Downloading prettytable-3.10.0-py3-none-any.whl (28 kB)
Requirement already satisfied: ipython in c:\users\rein\onedrive\desktop\dph02\venv\lib\site-packages (from ipython-sql) (8.25.0)
Collecting greenlet!=0.4.17
  Downloading greenlet-3.0.3-cp310-cp310-win_amd64.whl (292 kB)
     -------------------------------------- 292.3/292.3 kB 6.1 MB/s eta 0:00:00
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\rein\onedrive\desktop\dph02\venv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: pygments>=2.4.0 in c:\users\rein\onedrive\desktop\dph02\venv\lib\site-packages (from ipython->ipython-sql) (2.18.0)
Requirement already satisfied: matplotlib-inline in c:\users\rein\onedrive\desktop\dph02\venv\lib\site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: colorama in c:\users\rein\onedrive\desktop\dph02\venv\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: decorator in c:\users\rein\onedrive\desktop\dph02\venv\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\rein\onedrive\desktop\dph02\venv\lib\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: jedi>=0.16 in c:\users\rein\onedrive\desktop\dph02\venv\lib\site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: exceptiongroup in c:\users\rein\onedrive\desktop\dph02\venv\lib\site-packages (from ipython->ipython-sql) (1.2.1)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in c:\users\rein\onedrive\desktop\dph02\venv\lib\site-packages (from ipython->ipython-sql) (3.0.47)
Requirement already satisfied: stack-data in c:\users\rein\onedrive\desktop\dph02\venv\lib\site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: wcwidth in c:\users\rein\onedrive\desktop\dph02\venv\lib\site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in c:\users\rein\onedrive\desktop\dph02\venv\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: pure-eval in c:\users\rein\onedrive\desktop\dph02\venv\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\rein\onedrive\desktop\dph02\venv\lib\site-packages (from stack-data->ipython->ipython-sql) (2.4.1)
Requirement already satisfied: executing>=1.2.0 in c:\users\rein\onedrive\desktop\dph02\venv\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.1)
Installing collected packages: ipython-genutils, sqlparse, prettytable, greenlet, sqlalchemy, ipython-sql
Successfully installed greenlet-3.0.3 ipython-genutils-0.2.0 ipython-sql-0.5.0 prettytable-3.10.0 sqlalchemy-2.0.30 sqlparse-0.5.0
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.2.1 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

## Load the SQL Extension

In [3]:
%load_ext sql

%sql -- single SQL statements

%%sql -- multiline SQL code blocks

## Create SQLite Database

In [4]:
%sql sqlite:///sql-database.db

## Create Table
Syntax:
```
%%sql CREATE TABLE IF NOT EXISTS table-name (
    column1 data-type constraint,
    column2 data-type constraint,
    ...,
    columnN data-type constraint
);
```

In [5]:
%%sql
CREATE TABLE IF NOT EXISTS employees (
    employee_id INT PRIMARY KEY,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    department VARCHAR(50),
    salary DECIMAL(10, 2) NOT NULL
);

 * sqlite:///sql-database.db
Done.

[]

### Check if the Table is successfully Created.

In [6]:
%sql SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///sql-database.db
Done.

[('employees',)]

### Check the Structure of the Table

Syntax:
```
%sql PRAGMA table_info('table-name');
```

In [8]:
%sql PRAGMA table_info('employees');

 * sqlite:///sql-database.db
Done.

[(0, 'employee_id', 'INT', 0, None, 1),
 (1, 'first_name', 'VARCHAR(50)', 1, None, 0),
 (2, 'last_name', 'VARCHAR(50)', 1, None, 0),
 (3, 'department', 'VARCHAR(50)', 0, None, 0),
 (4, 'salary', 'DECIMAL(10, 2)', 1, None, 0)]

### Altering the Table
Syntax:
```
%%sql ALTER TABLE table-name
ADD column-name data-type;
```

In [12]:
%%sql ALTER TABLE employees
ADD hire_date DATE;

 * sqlite:///sql-database.db
Done.

[]

In [13]:
%%sql ALTER TABLE employees
ADD performance_rating INT;

 * sqlite:///sql-database.db
Done.

[]

### Check the Structure of the Table

In [14]:
%sql PRAGMA table_info('employees');

 * sqlite:///sql-database.db
Done.

[(0, 'employee_id', 'INT', 0, None, 1),
 (1, 'first_name', 'VARCHAR(50)', 1, None, 0),
 (2, 'last_name', 'VARCHAR(50)', 1, None, 0),
 (3, 'department', 'VARCHAR(50)', 0, None, 0),
 (4, 'salary', 'DECIMAL(10, 2)', 1, None, 0),
 (5, 'hire_date', 'DATE', 0, None, 0),
 (6, 'performance_rating', 'INT', 0, None, 0)]

## Inserting Data
Syntax:
```
%%sql
INSERT INTO table-name (column1, column2, ..., columnN) 
VALUES (value1, value2, ..., valueN);
```

In [15]:
%%sql
INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (1, 'John', 'Doe', 'Sales', 50000.00, '2024-05-30', 3);

 * sqlite:///sql-database.db
1 rows affected.

[]

## Selecting Data
Syntax:
```
%sql SELECT * FROM table-name;
```

In [16]:
%sql SELECT * FROM employees;

 * sqlite:///sql-database.db
Done.

[(1, 'John', 'Doe', 'Sales', 50000, '2024-05-30', 3)]

### Selecting Specific Column/s
Syntax:
```
%%sql SELECT column1, column2, ..., columnN 
FROM table-name;
```

In [17]:
%%sql SELECT first_name, last_name, department 
FROM employees;

 * sqlite:///sql-database.db
Done.

[('John', 'Doe', 'Sales')]

## Update Data
Syntax:
```
%%sql UPDATE table-name 
SET column-name = new-data 
WHERE primary-key = value;
```

In [18]:
%%sql UPDATE employees 
SET salary = 55000.00 
WHERE employee_id = 1;

 * sqlite:///sql-database.db
1 rows affected.

[]

In [19]:
%sql SELECT * FROM employees;

 * sqlite:///sql-database.db
Done.

[(1, 'John', 'Doe', 'Sales', 55000, '2024-05-30', 3)]

## Inserting more Data

In [20]:
%%sql
INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (2, 'Jane', 'Smith', 'Marketing', 55000.00, '2024-04-25', 4),
       (3, 'Michael', 'Johnson', 'Sales', 60000.00, '2024-04-26', 5),
       (4, 'Emily', 'Davis', 'Operations', 62000.00, '2024-04-27', 2),
       (5, 'David', 'Wilson', 'Operations', 58000.00, '2024-04-28', 1);

 * sqlite:///sql-database.db
4 rows affected.

[]

In [21]:
%sql SELECT * FROM employees;

 * sqlite:///sql-database.db
Done.

[(1, 'John', 'Doe', 'Sales', 55000, '2024-05-30', 3),
 (2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-25', 4),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-26', 5),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-27', 2),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1)]

## Deleting Data
Syntax:
```
DELETE FROM table-name
WHERE primary-key = value;
```

In [22]:
%%sql DELETE FROM employees
WHERE employee_id = 4;

 * sqlite:///sql-database.db
1 rows affected.

[]

### Comfirm the Deletion:

In [23]:
%sql SELECT * FROM employees;

 * sqlite:///sql-database.db
Done.

[(1, 'John', 'Doe', 'Sales', 55000, '2024-05-30', 3),
 (2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-25', 4),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-26', 5),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1)]

## Deleting Table
Syntax:
```
%sql DROP TABLE table-name;
```

In [ ]:
# DROP if necessary